Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/magne-s.htm.tmx
Source language: sme
Languages: nob

source: Mun muosehuhtten iežan čuorvumiin , nu lohke .
nob: Jeg forstyrret med mine høge skrik , ble det sagt .

source: Juo , muittán ollu mánáidskuvllas , muhto buoremus muittut leat báhcán luohkkálanjas .
nob: Jo da , jeg husker mye fra barneskolen , men de virkelig positive minnene er fra klasserommet .

source: Ja de in háliit muitit čuoiganbeivviid ja olgobeivviid goas fertejin báhcit skuvlii go earát manne olggos , earret daid háviid go mu váhnemat ovdagihtii nagodedje hehttet ahte mun báhcen skuvlii akto .
nob: Så orker jeg ikke huske skidagene og utedagene der jeg måtte bli igjen på skolen mens de andre dro ut , unntatt de gangene mine foreldre i forkant klarte forhindre at jeg ble igjen på skolen alene .

source: In háliit ge muitit daid álkis ja soaittáhatlaš čovdosiid , in ge dan ahte nuppis nubbái oahpahus lei sorjavaš das geainna ledjen ovttas .
nob: Jeg orker heller ikke huske de lettvinte og tilfeldige løsningene , ei heller at en-til-en-opplegget var avhengig av hvem jeg hadde en-til-en med .

source: Soapmásiiguin doaimmai bures .
nob: Med noen fungerte det godt .

source: Earáiguin fas šattai nu ahte oađestuvven , ja rávis olbmot lohke aviissaid dahje buđaldedje eará ládje .
nob: Med andre ble det ofte slik at jeg småsov , mens den en-til-en-voksne leste avisa eller gjorde andre ting .

source: Dákkár oahpahus gáibida garra bargoetihka rávis olbmuin .
nob: Slike opplegg krever beinhard yrkesetikk fra de voksne .

source: Mun ledjen iežan autistalaš dovdomearkkaiguin áiggiid idjagohcálas .
nob: Jeg var med mine autistiske trekk nattevandrer i perioder .

source: Dalle ođđen bures skuvllas dan botta go mu váhnemat garrasit geahččaleigga oažžut mus jorggihit oađđima .
nob: Da sov jeg ut på skolen mens mine foreldre fortvilt prøvde å snu søvnvanene .

source: Lei veadjemeahttun ja váttis .
nob: Ganske umulig og vanskelig .

source: Muittán ahte muhtin áiggiid lávejin veallát sevdnjes lanjas – gozuid nalde – nuppiin mu váhnemiin .
nob: Jeg husker at jeg i de periodene pleide ligge på et mørkt rom – våken – med en av foreldrene mine .

source: Go šattai iđit , de vulgen skuvlii nohkkat , ja soai bargui .
nob: Når de ble morgen , dro jeg på skolen for å sove ut , og de på jobb .

source: Ii go skuvla geahččalan dán rievdadit ?
nob: Om skolen ikke kunne prøve å snu dette ?

source: Juo , muittán bures ahte go álgen nuoraidskuvlii Skániid skuvllas , de rievddai dilli máŋgga ládje .
nob: Jo , jeg husker så godt at da jeg ble ungdomsskoleelev på Skånland skole , ble det andre boller på mange måter .

source: Olbmot geat barge muinna , ledje ovttaoaivilis ahte áigot jorgalit mu autistalaš idjagohcima , mat ledje nu ahte gohcen ijaid ja doalahin earáid maid gozuid nalde iežan hommáiguin .
nob: Teamet rundt meg var entydige i at de ville gjøre alt de kunne for å snu de autistiske nattevandringene , det vil si at jeg lå våken om nettene og holdt de andre våkne med mine gjøren og laden .

source: Dakkaviđe go dákkár áigodat álggii , de rievdadedje bargovugiid skuvllas .
nob: Straks en slik periode startet , la de om opplegget på skolen .

source: Ledjen ollu olgun , ja jus ribahin nahkáriid , de lei dušše 5–10 minuhttii , ii ge olles skuvlabeaivái dahje osiide das .
nob: Jeg var mye ute , og sovnet jeg , var det for 5–10 minutter og ikke for hele skoledagen eller deler av den .

source: Ruovttus čuovvoledje dán bargovuogi maŋŋil skuvlla , ja fargga lei dát áigodat nohkan , giitun ovttasbargui gaskal nuoraidskuvlla ja ruovttu , dan oainnán dál maŋit áiggis .
nob: Heime fulgte de opp om ettermiddagen , og ganske snart var en slik periode over takket være godt samarbeide mellom ungdomsskolen og heimen , det ser jeg nå i ettertid .

source: Dalle lávii dát mu mielas vuorjan , muhto vuorjan mii oalát heaittihii mu idjagohcima .
nob: Da syntes jeg det var et mas , men et mas som totalt avskaffet vandreperiodene , det vil si nattevåkinga .

source: Ferten gal beassat lohkat , iežan bealuštussan – in gohcán gal dan dihte háliidin leat bahánihkkán !
nob: Jeg får si til mitt forsvar – jeg våkte ikke om natta for å være ekkel !

source: Mun dušše in nagodan oađđit .
nob: Jeg klarte bare ikke sove .

source: Muhto dát nogai jođánit go buot fámut biddjojedje johtui rievdadit dan .
nob: Men det tok slutt i løpet av kort tid når alle krefter satte i gang aksjon for å snu dette .

source: Lea nuoraidskuvla maid muittán buoremus vásihussan buot mu skuvlavázzimiin dan rájis go álgen mánáidgárdái ( mas juo in várra muitte maidege ) , ja gitta dassái gergen joatkkaskuvllas .
nob: Faktisk er det ungdomsskolen jeg husker som det mest positive i mitt løp fra barnehage ( der jeg ikke husker noe , tror jeg ) og til og med videregående .

source: Mus lei sierra latnja nuoraidskuvllas maid , muhto orun muitime ahte in dovdan iežan nu akto doppe .
nob: Jeg hadde mitt eget rom på ungdomsskolen også , men jeg kan ikke huske at jeg følte meg så alene der .

source: Mun jáhkán ahte dasa lei sivvan bargojoavku geat muinna barge , sii ožžo mu dovdat dego oassin dán joavkkus , ja dainna lágiin in dovdan iežan akto , ja dasa lei maid sivvan ahte duođas geahččalin bargat iežan buoremusa doppe .
nob: Jeg tror det skyldes teamet rundt meg som var aktive og på en underlig måte fikk meg til å føle meg som en av teamet og som sådan ikke alene , samt at jeg prøvde å gjøre mitt beste der .

source: Bargojoavkkus ledje hutkát iežaset bargovugiiguin , ja muittán iluin ollu maid doppe barggaimet .
nob: Teamet var kreative i sine opplegg , og jeg husker med glede mange av de ting vi gjorde der .

source: Roabáhis 1992 giđa Asbjørn Pedersena fatnasis .
nob: På Grovfjorden våren 1992 i sjekta til Asbjørn Pedersen .

source: Ragnhild Sørlie ja Elsa Pedersen Skogstad leaba maid govas .
nob: Ragnhild Sørlie og Elsa Pedersen Skogstad på bildet .

source: Nuoraidskuvllas dovden ahte ledjen oassin joavkkus .
nob: På ungdomsskolen følte jeg meg som en av teamet .

source: ( Govva : Arne Iversen )
nob: ( Foto : Arne Iversen )

source: Maŋimuš beaivi nuoraidskuvllas .
nob: Siste dag på ungdomsskolen .

source: Arne Iversen lei mu joavkojođiheaddji nuoraidskuvllas .
nob: Arne Iversen var teamlederen min på ungdomsskolen .

source: Njelješjoavku ii doaibman munnje
nob: 4-gruppe fungerte ikke for meg

source: Joatkkaskuvllas álgen nu gohčoduvvon njelješjovkui [ 1 ] , gosa in heađisge gullan searvái , ja bargojoavku doppe lei unnán movttiidahtti .
nob: I videregående skole kom jeg med i en såkalt 4-gruppe [ 1 ] der jeg slett ikke følte jeg hørte til , og teamet der ble etter hvert rimelig lite dynamisk .

source: Skuvlla hálddahus lei positiiva .
nob: Skoleadministrasjonen var positiv .

source: Skuvlla rektora dovden maid dego iežan rektorin .
nob: Rektor følte jeg var min rektor også .

source: Muhto dát ii dovdon makkárge movttiidahttimiin mu bargovugiide .
nob: Men dette nedfelte seg ikke i dynamikk rundt mitt opplegg .

source: Muittán ahte muhtin bargit ledje aktiiva ja ehtalaččat mu vuostá ja mu bargovugiid vuostá .
nob: Jeg husker enkelte ansatte som aktive og etiske i forhold til meg og mitt opplegg .

source: Muhto muittán maid earáid geat ledje duipát ja unnán ehtalaččat .
nob: Men jeg husker også andre som sløve og rimelig ikke-etiske .

source: Ruoššaráhkkanemiin muittán unnán , dušše dan go fáhkkestaga šattai issoras riedja ja hušša dáppe ruovttus go fuobmáje ahte ruoššakoarttat , ruoššanamma ja diet proseassa manai mu meattá .
nob: Russeforberedelsene er et vagt minne om et plutselig styr her heime da man oppdaget at russekort , russenavn og den prosessen gikk uten meg .

source: Mu váhnemat riŋgejedje muhtin eará oahppái , gii ovttatmano álggii bargat mu ovddas ja nu nagodii ordnet buot maŋimus áigemearis .
nob: Foreldrene mine ringte en av de andre elevene , som heiv seg rundt og ordnet opp i det i siste liten .

source: Maŋŋil oainnán man rašši skuvlavuogádat lea dákkár ohppiide dego mun ledjen , ja man sorjavaš dat lea čeahpes ja áŋgiris joavkojođiheddjiin ja bargoehtalaš ja áŋgiris mielbargiin .
nob: I ettertid ser jeg hvor sårbart et skoleopplegg er for elever som meg og hvor avhengig det er av en dyktig og engasjert teamleder og yrkesetiske og engasjerte medarbeidere .

source: Šaddá jođánit bargguid eretduvdin ja garvin dákkár nuppis nubbái bargovugiin ja B-diimmuid [ 2 ] boasttugeavaheapmi , go atnet dáid diimmuid čoavdit sadjásašoahpaheddjiid dárbbuid go fáhkka čuožžila dat dárbu , seamma leahtuin go ahte šaddá beaktilis oahpaheapmi .
nob: Det blir lett subb og unnaluring i slike en til en opplegg og misbruk av B-timer [ 2 ] til for eksempel å løse øyeblikkets vikarproblem – likeså gjerne som det blir effektiv opplæring .

source: Iešguđetlágan oainnut go álgen fasiliteret
nob: Ulike reaksjoner da jeg begynte å fasilitere

source: Go álgen fasiliteret cuoŋománu 2005 ja máilbmi mu birra beasai diehtit ahte ipmirdin , čuvvon mielde ja ahte álo ledjen ipmirdan ja čuvvon mielde , de dajai okta mu ovddeš oahpaheddjiin ahte son dál lei ilus go bures duosttai deaivvadit muinna ja geahččat mu čalmmiide , Son diđii ahte son lei čábbát láhtten muinna , ii lean meannudan fasttit mu vuostá , ii ge hupman fasttiid mu birra dahje gohčodan mu váhnemiid badjelmearálaš gáibideaddjin ja váttisin .
nob: Da jeg begynte å fasilitere i april 2005 og verden rundt meg fikk vite at jeg forstod , fulgte med og alltid hadde forstått og fulgt med , sa en av mine tidligere lærere at hun nå virkelig var glad for at hun trygt kunne møte meg og se meg i øynene . Hun visste at hun ikke hadde slumset med meg , behandlet meg stygt , snakket nedsettende om meg eller kommentert mine foreldre som kravstore og vanskelige .

source: Son duosttai duođas muinna deaivvadit , logai son , ja dan son lea máŋgii dahkan – deaivvadan muinna .
nob: Hun kunne trygt møte meg , sa hun , og det har hun gjort mange ganger – møtt meg , mener jeg .

source: Earát fas garvet mu ja atnet mu áibmun .
nob: Andre unngår meg og behandler meg som luft .

source: Sii eai oainne mu .
nob: De ser meg ikke .

source: Soaitá ahte sii jurddašit maid mun muittán das maid lean vásihan ja gullan .
nob: Kanskje lurer de på hva jeg kan huske både å ha opplevd og ha hørt .

source: Roavvásit sáhtán juohkit dáid olbmuid golmma jovkui : 1 ) sii geat deaivvadit muinna iluin , jearahit ja illudit mu ovdánemiin .
nob: Grovt sett kan jeg dele denne gruppen i tre . 1 ) De som møter meg med glede , spør og gler seg over min framgang .

source: 2 ) sii geat atnet mu áibmun ja 3 ) sii geat mulgot ja oaivvildit ahte mu ovdáneapmi lea loavkideapmin ja moaittan sin bargomállii .
nob: 2 ) De som opptrer som om jeg er luft og 3 ) De som skuler på meg og synes min utvikling er en fornærmelse og en kritikk mot det de drev og driver med .

source: Dát lea dušše unna oasáš olbmuin , muhto sii leat dás , ja mun deaivvadan duollet dálle singuin .
nob: Dette er en promille , men de er der , og jeg treffer dem ender nu og da.

source: Ceaggás rektor
nob: Rakrygget rektor

source: Muittán máŋga erenoamáš vásihusa skuvlaáiggis ja áiggun loahpas váldit mielde ovtta maid muittán iluin .
nob: Jeg husker mange spesielle episoder gjennom skoleløpet og vil avslutningsvis ta med en jeg husker med glede .

source: Joatkkaskuvlla rektor lei maiddái mu ovddas ceaggás skuvlajođiheaddji .
nob: Rektor på skolen på videregående husker jeg som en rakrygget skoleleder for også meg .

source: Máŋgga dáfus dovden mun su iežan rektorin maid .
nob: I mange situasjoner følte jeg ham virkelig som min rektor også .

source: Sáhtán dás namuhit ovtta dáhpáhusa .
nob: Jeg kan nevne en av dem.

source: Mun mannen ja bohten bussiin skuvlii juohke beaivvi , nu go earát ge .
nob: Jeg reiste til og fra skolen med skolebussen hver dag , jeg som de andre .

source: Lei gudnin mu váhnemiidda ahte bessen busse čuovvut , in ge lean nu erenoamáš ahte dárbbašin drošše váldit .
nob: Det var takket være mine foreldre som nektet meg å være så spesiell at jeg reiste med drosje .

source: Busses čohkkájin ovddemusas , mus lei iežan fásta sadji , muhto in han mun háliidan doppe čohkkát .
nob: I bussen satt jeg helt fremst . Jeg hadde min faste plass , men det var ikke der jeg ville sitte .

source: Mun háliidin čohkkát maŋágeahčen daiguin vuovdnás bártniiguin mat huike ja stivreje doppe .
nob: Jeg ville sitte bak i bussen sammen med den tøffe gjengen som hoiet og styrte der .

source: Muhto nu han mun in beassan .
nob: Men slik ble det jo ikke .

source: Muhtumin huiken ja stivrejin iežan sajis ovddageahčen , vilden ja čikčen julggiiguin .
nob: I blant hoiet og styrte jeg på min plass i bussen , ble ivrig og sparket med beina .

source: Ovtta beaivvi ožžo mu váhnemat telefovnna bussefitnodagas .
nob: En dag fikk foreldrene mine telefon fra busselskapet .

source: Sii oaivvildedje ahte mun balddán vuosttašluohkahasaid geat čuvvot busse .
nob: De mente jeg skremte førsteklassingene som var med skolebussen .

source: Sii leat ožžon váidagiid , lohke , muhtin dáid mánáid váhnemiin .
nob: De hadde fått klage , sa de , fra foreldrene til en av disse førsteklassingene .

source: Dál oaivvildedje bussefitnodagas ahte mun sáhtášin váldit drošše , mus han lei riekti oažžut drošše .
nob: Nå mente busselskapet at jeg kunne kjøre drosje . Jeg hadde jo drosjerett .

source: Ja de lei dahkkon !
nob: Og dett var dett !

source: Mu váhnemat suhtaiga issorasat , nie jáhkán rievttamus dadjat , ja hilgguiga árvalusa .
nob: Mine foreldre ble rasende , det tror jeg er det rette ordet , og nektet .

source: Soai áigguiga čoahkkima bussefitnodagain ja joatkkaskuvllain dán ášši birra .
nob: De ville ha et møte med busselskapet og skolen , videregående , om saken .

source: Jáhkán ahte šattai issoras ságastallan máŋgga ládje .
nob: Det ble et belivet møte på mange måter , tror jeg .

source: In lean ieš dan čoahkkimis , in ge lean duođas nu gealdagasas ge gullat bohtosa dán čoahkkimis .
nob: Jeg var ikke med der , og egentlig var jeg ikke spent på utfallet .

source: Ledjen áiggiid čađa oahppan makkár áššiin mu váhnemat eaba vuollánan ja dá lei okta dain , dan gal dovden .
nob: Jeg hadde etter hvert lært å vite i hvilke situasjoner mine foreldre ikke bøyde av , og dette var en av dem , det følte jeg .

source: Dat mii duođas hirpmástuhtti mu , ii lean gal ahte mu váhnemat eaba vuollánan , muhto rektor gii maid ii vuollánan ja lei dadjan juoga ládje de go ahte son ii dohkket ahte ná skuhččejit su oahppi .
nob: Den store overraskelsen var ikke at de ikke bøyde seg for busselskapet . Overraskelsen var rektor som ikke bøyde av seg og hadde sagt noe sånt som at han ikke aksepterte denne trakasseringa av en av hans elever .

source: Go eará go skuhččen ii lean dát .
nob: For annet enn trakassering var det ikke .

source: Skániid joatkkaskuvlla rektor lei čuojaldahttán Skániid skuvlla rektorii ( gean ledjen maid dovdan iežan rektorin dalle go vázzen nuoraidskuvlla doppe ) ja hupman suinna dán ášši birra .
nob: Rektor på Skånland videregående skole hadde ringt rektor på Skånland skole ( som jeg følte var min rektor også mens jeg var ungdomsskoleelev der ) og snakket med ham om saken .

source: Skániid skuvlla rektor lei álgán bargat áššiin ja lei jearran dáid vuosttašluohká mánáid váhnemiin geat čuvvo busse , ja de gulai ahte ii oktage mánná lean balddáskan – ja ahte ii oktage váhnen lean váidán bussefitnodahkii !
nob: Rektor på Skånland skole heiv seg rundt og kontaktet foreldrene til de førsteklassingene som reiste med samme skolebuss som jeg , og han fikk bekreftet at ingen hadde redde barn – og ingen hadde klaget til busselskapet !

source: Dál háliidii joatkkaskuvlla rektor duođas boahtit diehtit mii lei dáhpáhuvvan !
nob: Nå ville rektor på videregående vite hva dette egentlig var !

source: Son bivddii bussefitnodaga albma ládje čilget man vuođul sii háliidit mu eret busses .
nob: Han bad busselskapet redegjøre for sine egentlige motiver for at de ville hive meg av bussen .

source: Boađusin dás lei ahte ovtta beaivvi lei eará olmmoš gii vujii busse , ja oallut eará mátkkošteaddjit go mun liikoje go lotnašuvai bussevuoddji .
nob: Det hele kokte ned til at plutselig en dag kjørte en annen sjåfør denne skolebussen , og flere bussreisende enn jeg var glad for det skiftet .

source: In dieđe lean go mun dahje mu váhnemat ožžon ándagassii bivdima bussefitnodagas maid rektor gáibidii dál galget addit midjiide !
nob: Jeg vet ikke om jeg og mine foreldre noen gang fikk den unnskyldninga rektor sa busselskapet nå burde komme med til oss !

source: Skuvla ii gávdnan geainnu
nob: Skolen fant ikke vegen

source: In dieđe movt galggan suhkat gáddái dán artihkkala eanet go ahte munnje lei oahpahus huksejuvvon vuoiŋŋašvigi dovdomearkkaide , ii ge sivaide , ja vuoiŋŋašvihki lei man vuostá galggai bargojuvvot .
nob: Jeg vet ikke helt hvordan å dra denne artikkelen i havn annet enn å si at det for meg var slik at opplæringa bygde på et symptom av hjerneskaden og ikke på årsaken , en hjerneskade man skulle rette støtet mot .

source: Duođas in sáhte muitit ahte vuoiŋŋamaččat ledje áigeguovdilis áššin ovdal go álggiimet domanhárjehallama ráhkkanemiiguin 2004:s .
nob: Faktisk kan jeg ikke huske at hjernen var tema i det hele tatt før vi begynte domantreningsforberedelsene i 2004 .

source: Domaninstituhtas oainnán mánáid geat ovdánit ollislaš vuoiŋŋamašovdánahttinprográmmain maid sii ožžot .
nob: På Domaninstituttet ser jeg barn i skolealderen utvikle seg på det helhetlige hjerneutviklingsprogrammet de får .

source: Dán prográmmas lea fysalaš hárjehallan , fysiologalaš prográmma , intellektuála ovddidanprográmma ja biebmanprográmma , ja maid vuđolaš doavtteriskkus guovtti háve jagis .
nob: I dette programmet inngår fysisk trening , fysiologisk program , intellektuelt program og ernæringsprogram , samt grundig legesjekk to ganger i året .

source: Fágaolbmot dán suorggis ovttasbarget , ja buktet ovtta ollislaš prográmma mii lea vuoiŋŋamašovdáneami várás ja mii evaluerejuvvo ja viidáset ovdánahttojuvvo guovtti háve jagis .
nob: Fagfolk på de ulike felt samarbeider , og det blir et helhetlig program som retter seg mot hjerneutvikling og evalueres og videreutvikles to ganger i året .

source: Dás lea ollislaš plánen duogábealde , ja dát ollislaš plána lea huksejuvvon govvii ja ipmárdussii vuoiŋŋamaččaid doaibmamis .
nob: Det ligger en helhetlig plan bak , og denne helhetlige planen bygger på et bilde av og en forståelse av hjernens funksjoner .

source: Jus buohtastahtán dán iežan prográmmain maid ožžon geatnegahtton skuvllas , dainna fálaldagain maid Norgga stáhta fálai dákkáriidda go mun lean , de orro skuvlavázzin maid mun vázzen hádjánan ja váilevaš .
nob: Sammenligner jeg dette med mitt program i den obligatoriske skolen , det staten Norge tilbyr slike som meg , virker det skoleløpet jeg gjennomgikk fragmentert og tafatt .

source: Ii fal ovttaskas olbmuid dahje suohkana skuvlahálddahusa dihte , muhto dan ipmárdusa dihte dahje ipmárdusa váilevašvuođa dihte vuoiŋŋašvigiid birra mii lei vuođđun dan bagadussii maid oahpahus oaččui .
nob: Ikke på grunn av enkeltmennesket eller skoleadministrasjonen i kommunen , men på grunn av den viten eller manglende viten om hjerneutvikling som lå til grunn for den veiledningen opplæringa fikk .

source: Máŋga jagi maŋŋá go rassen sabehiiguin ja diagonála-hárjehallamiin , bijai Domaninstituhtta munnje « patterning » prográmman .
nob: Mange år etter skiene og håpet om diagonaltrening , la Domaninstituttet patterning som program .

source: Dás lei earret eará diagonála-hárjehallan .
nob: Dette var blant annet diagonaltrening .

source: Anne Oppholt jođiha « patterning » - hárjehallama .
nob: Anne Oppholt leder patterning .

source: Maren Anne Nygård ja Katya Tverfjeld lihkaheaba mu gieđaid , ja eadni ja áhčči lihkaheaba mu julggiid .
nob: Maren Anne Nygård og Katya Tverfjeld beveger armene , og foreldrene mine beina . Alt i et rytmisk og avstemt mønster .

source: In dieđe man galle háve čađahin dakkár hárjehallama dan njealji jagis maid prográmma bisttii , muhto ledje eaktodáhtolaš veahkit mat johte dáppe beaivválaččat . Oktiibuot ledje 30-40 veahki .
nob: Jeg vet ikke hvor mange patterning jeg hadde i de fire åra det varte , men mellom 30-40 frivillige vekslet på å gå her hver dag i fire år .

source: Eat dárbbašan goassege šluhttet ovttage hárjehallama danin go eai lean veahkit .
nob: Ikke en patterning ble avlyst av mangel på hjelpere .

source: ( Govva : Arnstein Tilseth )
nob: ( Foto : Arnstein Tilseth )

source: Ohppen almmátge sámegiela
nob: Planterhaug er ei samisk bygd .

source: Láŋtdievvá lea sámi gilli , mu áhkku ja áddjá humaiga sámegiela gaskaneaskka , muhto dárogiela iežaska mánáide , mu áhkku ja áddjá doalaiga sámivuođa badjin , ja mánát jotke seamma ládje , muhto eará ja viiddiduvvon vuođu nalde .
nob: Mine besteforeldre brukte samisk seg i mellom , men norsk til sine barn . Mine besteforeldre holdt den samiske fanen oppe , og deres barn fortsatte i samme løp , men på andre og utvidede grunnlag .

source: Sii buohkat ipmirdedje sámegiela , ja odne leat sii buohkat sámegielagat buorebutge das fuolakeahttá go danin .
nob: De forstod alle samisk , og i dag er alle samisktalende mer på tross av enn på grunn av ...

source: Mu eadni ja muoŧŧá álggiiga oahpaheaddjin sámegieloahpus mii áiggi mielde laskkai garrasit Skániin .
nob: Min mor og en tante ble lærere i den samiskundervisningen som etter hvert eksploderte i Skånland .

source: Muhto álggus ledje « bearraša mánát » geat lohke sámegiela .
nob: Men ved oppstart var der « familiens barn » som leste samisk .

source: Mun in dahkan dan .
nob: Jeg gjorde det ikke .

source: Dan vearrás diagnosa geažil mii mus lei de dihte mu váhnemat ahte mun ipmirdan mii dáhpáhuvvá dárogillii .
nob: Tross min usle diagnose visste mine foreldre at jeg forstod det som skjedde på norsk .

source: De šattai nu ahte dárogiella lei min ruovttugiella .
nob: Det ble slik at norsk ble heimespråket hos oss .

source: Ii oktage dáhtton ahte mun galgen dovdat iežan olggobealde .
nob: Ingen ville at jeg skulle falle utenfor .

source: Muhto dieđán ahte mu eadni humai sámegiela mu oappáiguin ja vieljaiguin go son lei akto singuin .
nob: Men jeg vet at min mor brukte samisk til mine søsken når hun var alene med dem.

source: Mus ii lean makkárge vejolašvuohta dieđihit eadnái ahte sáhtii hupmat sámegiela muinna maid , ii ge dan ahte mus livččii leamaš miella čuovvut earáge sámegieloahpahusa .
nob: Jeg hadde ingen måter å melde fra at hun kunne bruke samisk til meg også , ei heller at jeg glødende ville være med på samiskundervisningen generelt .

source: Ledjen mielde ollu doaimmain , ja maiddái ovtta máŋggabeaivásaš giellalávgumis .
nob: Jeg var med på en god del aktiviteter og faktisk også på et mange dagers språkbad .

source: Muhto mun in lean oahppin oahpahusas .
nob: Men jeg var ikke elev i undervisninga .

source: Movt mun ohppen sámegiela ?
nob: Hvordan jeg lærte samisk ?

source: In dieđe .
nob: Aner ikke .

source: Várra seamma ládje go earát ohppet ovtta giela passiivvalaččat .
nob: Antagelig på samme måte som andre lærer et språk passivt .

source: Go gullá dan ollu , de álgá maid ipmirdit dan .
nob: Man hører det mye og forstår etter hvert .

source: Mu eadni ja áhkku humaiga sámegiela gaskaneaskka .
nob: Min mor og bestemor brukte samisk seg i mellom .

source: Dasto lávejin mun doppe gos Sigbjørn , mus boarrásit viellja , ja Emma Margret , mu nuorat oabbá , barggaiga leavssuid .
nob: Dessuten pleide jeg henge litt der Sigbjørn , min litt eldre bror , og Emma Margret , min lillesøster , gjorde lekser .

source: Juohke diŋggas ávki , jáhkán mun , ja go beroštupmi gávdno , de gal oahppá .
nob: Alle monner drar , antar jeg , og er interessen der , lærer man.

source: Ja mus lei beroštupmi .
nob: Og interessert var jeg .

source: Odne máhtán čállit sámegillii .
nob: I dag kan jeg skrive på samisk .
